Repository: andrey-yantsen/boterator
Catalog: locales/*/LC_MESSAGES/boterator.po
Languages: ru_ru

# Received votes count
source: {votes_received} vote
ru_ru: {votes_received} голос

# Votes count
source: {votes_cnt} vote (with {votes_yes_cnt} {thumb_up_sign})
ru_ru: {votes_cnt} голос (при {votes_yes_cnt} {thumb_up_sign})

# Messages count
source: {messages_cnt} message
ru_ru: {messages_cnt} сообщение

# User not allowed to perform this action
source: Access denied
ru_ru: Доступ запрещён.

# User banned
source: Access denied
ru_ru: Доступ запрещён.

# Voting failed
source: Unfortunately your message got only {votes_received_msg} out of required {votes_required_msg} and won't be published to the channel.
ru_ru: К сожалению, ваше сообщение получило только {votes_received_msg} из необходимых {votes_required_msg} и не будет опубликовано в канале.

# Bot added to a known group
source: Hi there, @{bot_username}!
ru_ru: Привет, котаны!

# Bot added to an unknown chat when he isn't ready for this
source: This bot wasn't registered for group {group_title}, type /start for more info
ru_ru: Этот бот не был зарегистрирован для использования в группе {group_title}. Для получения дополнительной информации напишите /start в личном сообщении @BoteratorBot.

# New group created with bot and isn't ready for this
source: This bot wasn't registered for group {group_title}, type /start for more info
ru_ru: Этот бот не был зарегистрирован для использования в группе {group_title}. Для получения дополнительной информации напишите /start в личном сообщении @BoteratorBot.

# Bot received /attach command when he isn't ready
source: Incorrect command
ru_ru: Некорректный ввод.

# Message sent for verification
source: Okay, I've sent your message for verification. Fingers crossed!
ru_ru: Отлично, ваше сообщение отправлено на модерацию. Скрестим пальцы! :)

# Message publishing cancelled
source: Cancelled
ru_ru: Отменено.

# Pending command cancelled
source: Oka-a-a-a-a-ay.
ru_ru: Оке-е-е-е-е-ей.

# Message received, requesting the user to check the message once again
source: Looks good for me. I've printed the message in exact same way as it will be publised. Please, take a look on your message one more time. And click Confirm button if everything is fine
ru_ru: Мне нравится. Посмотри ещё раз, как будет выглядеть сообщение. Если всё в порядке, просто нажми Подтвердить.

# `Confirm` button on message review keyboard
source: Confirm
ru_ru: Подтвердить

# `Cancel` button on message review keyboard
source: Cancel
ru_ru: Отменить

# User send text message for verification while texts is disabled
source: Accepting text messages are disabled
ru_ru: Приём текстовых сообщение отключён.

# Incorrect text message received
source: Sorry, but we can proceed only messages with length between {min_msg_length} and {max_msg_length} symbols.
ru_ru: Необходимо ввести от {min_msg_length} до {max_msg_length} символов.

# User sent empty message
source: Seriously??? 8===3
ru_ru: Кажется, вы забыли добавить текст в ваши пробелы.

# User sent a sticker for verification while stickers are disabled
source: Accepting stickers is disabled
ru_ru: Приём стикеров отключён.

# User sent an audio for verification while audios are disabled
source: Accepting audios is disabled
ru_ru: Приём аудио отключён.

# User sent a voice for verification while voices are disabled
source: Accepting voice is disabled
ru_ru: Приём голосовых сообщений отключён.

# User sent a video for verification while videos are disabled
source: Accepting videos is disabled
ru_ru: Приём видео отключён.

# User sent a photo for verification while photos are disabled
source: Accepting photos is disabled
ru_ru: Приём изображений отключён.

# User sent a document for verification while documents are disabled
source: Accepting documents is disabled
ru_ru: Приём документов отключён.

# Verification message
source: Say {thumb_up_sign} ({vote_yes_cmd}) or {thumb_down} ({vote_no_cmd}) to this amazing message. Also you can just send a message to the user ({reply_cmd}). Or even can BAN him ({ban_cmd}).
ru_ru: Время голосовать! {thumb_up_sign} {vote_yes_cmd} {thumb_down} {vote_no_cmd} Что ещё можно сделать: Отправить пользователю сообщение {reply_cmd} Забанить негодяя {ban_cmd}

# Message verified and queued for publishing
source: Your message was verified and queued for publishing.
ru_ru: Ура! Ваше сообщение было одобрено и добавлено в очередь публикаций.

# /help command response
source: bot.help.response
ru_ru: Справка для владельцев бота: /setdelay — изменить задержку между публикациями сообщений (текущее значение: {current_delay_with_minutes}) /setvotes — изменить необходимое количество {thumb_up_sign} для публикации или {thumb_down_sign} для отклонения сообщения (текущее значение: {current_votes_required}) /settimeout — изменить продолжительность голосования (текущее значение: {current_timeout_with_hours}) /pollslist — список активных голосований /settextlimits — изменить ограничение на длинну текстовых сообщение (текущее значение: {current_text_limit[min]}..{current_text_limit[max]}) /togglepower — изменить состояние власти модераторов (текущее значение: {power_state}) /stats — отобразить статистику за последние 7 дней. Можно изменить период сбора статистики: — `/stats 5` последние 5 дней, — `/stats 2016-01-13` 1 конкретный день — `/stats 2016-01-01 2016-01-31` для произвольного периода /banlist — отобразить список забаненных пользователей /setlanguage — изменить язык интерфейса /setallowed — изменить список разрешённых типов сообщений /setstartmessage — изменить стартовое сообщение бота (текущее значение: {current_start_message}) /togglevote — переключить отображение распределения голосов (текущее значение: {public_vote_state}) /toggleselfvote — переключить разрешение голосовать за свои сообщения (текущее значение: {selfvote_state}) /togglestartwebpreview — переключить отображение предпросмотра вэб-страниц в стартовом сообщении (текущее значение: {start_web_preview_state})

# New delay request
source: Set new delay value for messages posting (in minutes)
ru_ru: Введите новую задержку между публикациями сообщений (в минутах).

# Messages delay successfully changed
source: Delay value updated
ru_ru: Новая задержка между публикациями сообщений сохранена.

# New required votes count request
source: Set new amount of required votes
ru_ru: Установите новое количество голосов, необходимое для одобрения или отклонения сообщения.

# Required votes count successfully changed
source: Required votes amount updated
ru_ru: Новое количество необходимых голосов установлено.

# New voting duration request
source: Set new voting duration value (in hours, only a digits)
ru_ru: Установите новую продолжительность голосования (в часах, используйте только цифры).

# Voting duration successfully changed
source: Voting duration updated
ru_ru: Новая продолжительность голосования установлена.

# New start message request
source: Set new start message
ru_ru: Установите новое приветственное сообщение.

# Start message successfully changed
source: Start message updated
ru_ru: Приветственное сообщение обновлено.

# Too short start message entered
source: Invalid start message, you should write at least 10 symbols. Try again or type /cancel
ru_ru: Такое стартовое сообщение не подходит. Нужно использовать хотя бы 10 символов. Попробуйте ещё раз или введите /cancel.

# Power mode disabled
source: From now other chat users can not modify bot settings
ru_ru: Теперь другие участники чата модераторов НЕ МОГУТ изменять настройки бота.

# Power mode enabled
source: From now other chat users can modify bot settings (only inside moderators chat)
ru_ru: Теперь другие участники чата модераторов МОГУТ изменять настройки бота.

# No data for stats report
source: {cross_mark} no data
ru_ru: {cross_mark} нет данных

# Invalid stats request
source: Invalid period provided, correct value: `/stats 2016-01-01 2016-01-13`
ru_ru: Запрошен некорректный период, правильно писать вот так: `/stats 2016-01-01 2016-01-13`.

# Invalid stats request
source: Invalid period provided, correct value: `/stats 2016-01-01`
ru_ru: Запрошен некорректный период, правильно писать вот так: `/stats 2016-01-01`.

# Invalid stats request
source: Invalid period provided, correct values: `/stats 2016-01-01 2016-01-13`, `/stats 5` for last 5 days or `/stats 2016-01-01`
ru_ru: Запрошен некорректный период, правильно писать вот так: `/stats 2016-01-01 2016-01-13`, `/stats 5` для статистики за последние 5 дней или `/stats 2016-01-01`.

# Stats header
source: Stats for {period}
ru_ru: Статистика за {period}

# TOP type
source: TOP5 voters:
ru_ru: ТОП5 голосующих:

# TOP type
source: TOP5 users by messages count:
ru_ru: ТОП5 пользователей по количеству отправленных сообщений:

# TOP type
source: TOP5 users by published messages count:
ru_ru: ТОП5 пользователей по количеству опубликованных сообщений:

# TOP type
source: TOP5 users by declined messages count:
ru_ru: ТОП5 пользователей по количеству отклонённых сообщений:

# Ban reason request
source: Please enter a ban reason for the user
ru_ru: Укажите, пожалуйста, причину бана.

# Ban reason too short
source: Reason is too short (5 symbols required), try again or send /cancel
ru_ru: Может быть, как-то поразвёрнутей? :) (нужно ввести хотя бы 5 символов). Попробуйте ещё раз или отправьте /cancel.

# Message to user in case of ban
source: You've been banned from further communication with this bot. Reason: > {ban_reason}
ru_ru: К сожалению, вы были забанены. Дальнейшая коммуникация с ботом невозможна. Причина: > {ban_reason}

# Ban confirmation
source: User banned
ru_ru: Пользователь забанен.

# Ban user item
source: {row_id}. {user} - {ban_reason} (banned {ban_date}) {unban_cmd}
ru_ru: {row_id}. {user} — {ban_reason} (дата бана {ban_date}) {unban_cmd}

# Bot owner notification
source: You can use /unban command only in moderators group
ru_ru: Команду /unban можно использовать только в группе модераторов.

# Ban list is empty
source: No banned users yet
ru_ru: Ещё ни один пользователь не был забанен.

# Unban confirmation
source: User unbanned
ru_ru: Пользователь амнистирован!

# User notification in case of unban
source: Access restored
ru_ru: Вы амнистированы. Ура!

# Reply message request
source: What message should I send to user?
ru_ru: Какое сообщение отправить пользователю?

# Reply message is too short
source: Message is too short (10 symbols required), try again or send /cancel
ru_ru: Давайте всё-таки немного подробнее (нужно ввести хотя бы 10 символов). Попробуйте ещё раз или отправьте /cancel.

# Reply delivery confirmation
source: Message sent
ru_ru: Сообщение успешно отправлено.

# Reply failed
source: Failed: {reason}
ru_ru: Ошибка: {reason}

# Content type
source: Text
ru_ru: Текст

# Content type
source: Photo
ru_ru: Изображения

# Content type
source: Video
ru_ru: Видео

# Content type
source: Audio
ru_ru: Аудио

# Content type
source: Document
ru_ru: Документы

# Content type
source: Sticker
ru_ru: Стикеры

# Content type
source: Voice
ru_ru: Голосовые сообщения

# /changeallowed response
source: You can see current status on keyboard, just click on content type to change it's status
ru_ru: Вы можете видеть текущее состояние на клавиатуре. Просто нажмите на нужную кнопку чтобы разрешить или запретить тип сообщений.

# Invalid user response
source: Wrong input
ru_ru: Некорректный ввод.

# Change language prompt
source: Select your language
ru_ru: Выберите язык.

source: Language changed
ru_ru: Язык изменён.

# New length limits request
source: Please enter new value for length limits formatted like `{min_length}..{max_length}` (e.g. `1..10`)
ru_ru: Пожалуйста, введите новые ограничения в формате `{min_length}..{max_length}` (например, `1..10`).

# Bottom limit is too low
source: Bottom limit must be greater than 0
ru_ru: Нижний лимит не может быть меньше 0.

# Top limit is too low
source: Top limit must be greater than bottom one
ru_ru: Верхний лимит должен быть больше нижнего лимита.

# Text limits changed successfully
source: Limits updated
ru_ru: Новый текстовый лимит сохранен.

# Non-well formated text limits provided
source: Please use following format: `{min_length}..{max_length}` (e.g. `1..10`), or send /cancel
ru_ru: Пожалуйста, используйте формат: `{min_length}..{max_length}` (например, `1..10`), или отправьте /cancel.

# Moderator's ability to alter settings
source: yes
ru_ru: вкл

# Moderator's ability to alter settings
source: no
ru_ru: выкл

# Content type enabled/disabled
source: Texts enabled
ru_ru: Текстовые сообщения разрешены.

# Content type enabled/disabled
source: Texts disabled
ru_ru: Текстовые сообщения запрещены.

# Content type enabled/disabled
source: Photos enabled
ru_ru: Изображения разрешены.

# Content type enabled/disabled
source: Photos disabled
ru_ru: Изображения запрещены.

# Content type enabled/disabled
source: Videos enabled
ru_ru: Видео-сообщения разрешены.

# Content type enabled/disabled
source: Videos disabled
ru_ru: Видео-сообщения запрещены.

# Content type enabled/disabled
source: Audios enabled
ru_ru: Аудио-сообщения разрешены.

# Content type enabled/disabled
source: Audios disabled
ru_ru: Аудио-сообщения запрещены.

# Content type enabled/disabled
source: Voices enabled
ru_ru: Голосовые сообщения разрешены.

# Content type enabled/disabled
source: Voices disabled
ru_ru: Голосовые сообщения запрещены.

# Content type enabled/disabled
source: Stickers enabled
ru_ru: Стикеры разрешены.

# Content type enabled/disabled
source: Stickers disabled
ru_ru: Стикеры запрещены.

# User sent a command while another one is processing
source: Another action is in progress.
ru_ru: Минуточку. Я думаю.

# /pollslist reply message
source: There is {polls_msg} in progress:
ru_ru: Сейчас активно {polls_msg}.

# /pollslist reply on empty pending-polls list
source: There is no polls in progress.
ru_ru: На текущий момент активных голосований нет.

# Polls count
source: %d poll
ru_ru: %d голосование

# Command name
source: /reg â register a new bot
ru_ru: /reg — регистрация нового бота

# Action description
source: Waiting for the token
ru_ru: Ожидание ввода токена

# Action description
source: Waiting for the channel name
ru_ru: Ожидание названия канала

# Reply to END button press on a keyboard
source: Ok
ru_ru: Готово.

# Delay between channel messages
source: {delay} minute
ru_ru: {delay} минута

# Voting timeout
source: {timeout} hour
ru_ru: {timeout} час

# Polls count
source: {cnt} poll
ru_ru: {cnt} голосование

# Content type enabled/disabled
source: Documents enabled
ru_ru: Документы запрещены.

# Content type enabled/disabled
source: Documents disabled
ru_ru: Документы разрешены.

# Invalid delay value
source: Invalid delay value. Try again or type /cancel
ru_ru: Некорректное значение для зареджки между публикациями сообщений. Повторите попытку или отправьте /cancel.

# Invalid voting duration value
source: Invalid voting duration value. Try again or type /cancel
ru_ru: Некорреткное значение продолжительности голосования. Повторите попытку или отправьте /cancel.

# Invalid votes amount value
source: Invalid votes amount value. Try again or type /cancel
ru_ru: Некорректное значение для количества голосов. Повторите попытку или отправьте /cancel.

# Unknown command
source: I have no idea what a hell do you want from me, sorry :(
ru_ru: Некорректный ввод.

# Unable to establish startup connection with bot
source: I'm failed to establish connection to your bot with token `{token}`, received error: `{error}`. Your bot was deactivated, to enable it again - perform registration process from the beginning.
ru_ru: У меня не получилось установить соединение с ботом с токеном {token}. Ваш бот был деактивирован. Чтобы вернуть его, пройдите процесс регистрации с начала.

# /reg response
source: Ok, please tell me the token, which you've received from @BotFather
ru_ru: @BotFather дал вам токен. Пришлите его мне, пожалуйста.

# Empty token entered
source: I guess you forgot to enter the token :)
ru_ru: Мне кажется, вы забыли ввести токен :)

# Non-well formatted token
source: Token is incorrect. And I can do nothing with that.
ru_ru: Неверный токен. И я с этим ничего не могу поделать. Увы.

# Unable to validate token
source: Unable to validate token right now, please try again later
ru_ru: Не удалось проверить токен. Пожалуйста, повторите попытку.

# Provided token is already registered and alive
source: It seems like this bot is already registered. Try to create another one
ru_ru: Похоже, этот бот уже зарегистрирован. Попробуйте использовать другого бота.

# Token check failed
source: Unable to get bot info: {}
ru_ru: Ошибка при проверке токена: {}.

# Token received
source: Ok, I've got basic information for @{bot_username_escaped} Now add him to a group of moderators (or copy and paste `/attach@{bot_username}` to the group, in case you've already added him), where I should send messages for verification, or type /cancel
ru_ru: Окей, у меня есть базовая информация о @{bot_username_escaped}. Теперь добавьте этого бота в группу модераторов (или скопируйте и вставьте `/attach@{bot_username}`, если он уже состоит в этой группе), куда я буду отправлять сообщения на модерацию, или введите /cancel.

# Unable to receive moderation group
source: Unable to receive moderation group. Send me bot`s token if you would like to try again.
ru_ru: Не удалось получить идентификатор группы модерации. Если хотите повторить попытку — отправьте токен повторно, иначе отправьте /cancel.

# Slave attached to moderator`s channel
source: Ok, I'll be sending moderation requests to {chat_type} {chat_title} Now you need to add your bot (@{bot_username_escaped}) to a channel as administrator and tell me the channel name (e.g. @mobilenewsru) As soon as I will receive the channel name I'll send a message with following text: > {current_hello} You can change the message, if you mind, just send me /sethello. Also there is 'start' message for your new bot: > {current_start} You can change it with /setstart.
ru_ru: Окей, я буду отправлять сообщения на модерацию в {chat_title}. Теперь вам нужно добавить своего бота (@{bot_username_escaped}) в канал в качестве администратора и сказать мне имя канала. Как только я получу имя канала, я отправлю в него такой приветственный текст: > {current_hello} Вы можете изменить этот текст. Для этого отправьте мне /sethello. По умолчанию у вашего бота стоит вот такое приветственное сообщение: > {current_start} Его вы тоже можете изменить. Для этого отправьте мне /setstart.

# Invalid channel name received
source: Invalid channel name. Try again or type /cancel
ru_ru: Неверное имя канала. Попробуйте ещё раз или введите /cancel.

# Default votes cnt
source: {cnt} vote
ru_ru: {cnt} голос

# Default delay
source: {delay} minute
ru_ru: {delay}-минутную

# New bot registered
source: And we're ready for some magic! By default the bot will wait for {votes_cnt_msg} to approve the message, perform {delay_msg} delay between channel messages, wait {timeout_msg} before closing a voting for each message and allow only text messages (no multimedia content at all). To modify this (and few other) settings send /help in PM to @{bot_username}. By default you're the only user who can change these settings and use /help command
ru_ru: Теперь мы готовы к магии! :) По умолчанию бот будет ждать {votes_cnt_msg}, чтобы одобрить или отклонить сообщение, обеспечивать {delay_msg} задержку между сообщениями в канале, ждать {timeout_msg} до принудительного завершения голосования и допускать в канал только текстовые сообщения (никаких картинок, да-да). Чтобы изменить эти и некоторые другие настройки, отправьте /help в PM @{bot_username}. По умолчанию только вы можете менять настройки и использовать команду /help.

# Sending channel-hello message failed
source: Hey, I'm unable to send hello message, is everything ready for me? Here is an error from Telegram api: {error}
ru_ru: Что-то пошло не так. У меня не получилось отправить приветственное сообщение. Вы уверены, что всё готово? Вот, какую ошибку мне прислал Telegram API: {error}.

# /sethello response
source: Ok, I'm listening to you. How I should say hello to your subscribers?
ru_ru: Окей, я слушаю вас. Как мне приветстовать ваших подписчиков?

# Channel-hello message updated
source: Ok, noted, now tell me the channel name
ru_ru: Окей, готово. Теперь скажите мне имя канала.

# Channel-hello message is too short
source: Hey, you should write at least 10 symbols
ru_ru: Слишком коротко. Нужно использовать хотя бы 10 символов.

# /setstart response
source: Ok, I'm listening to you. How I should say hello to your authors?
ru_ru: Окей, я слушаю вас. Как мне приветстовать потенциальных авторов?

# /start message updated
source: Ok, noted, now tell me the channel name
ru_ru: Окей, готово. Теперь скажите мне имя канала.

# /start message is too short
source: Hey, you should write at least 10 symbols
ru_ru: Слишком коротко. Нужно использовать хотя бы 10 символов.

# Boterator`s /start response
source: Hello, this is Boterator. In order to start ask @BotFather to create a new bot. Then feel free to use /reg command to register new bot using token.
ru_ru: Привет. Это Ботератор. Для начала попросите @BotFather создать нового бота. Затем возвращайтесь сюда и используйте команду /reg и токен, который вам выдаст @BotFather.

# Default start message
source: Just enter your message, and we're ready.
ru_ru: Введите ваше сообщение.

# Default channel-hello message
source: Hi there, guys! Now it is possible to publish messages in this channel by any of you. All you need to do - is to write a message to me (bot named @{bot_username}), and it will be published after verification by our team.
ru_ru: Всем привет! Теперь подписчики могут публиковать информацию в этот канал. Для этого нужно прислать мне сообщение (бот @{bot_username}), и я отправлю его на модерацию.

# Ban reason request
source: Please enter a ban reason for the user, @{moderator_username}
ru_ru: Укажите, пожалуйста, причину бана, дорогой @{moderator_username}.

# Reply message request
source: What message should I send to user, @{moderator_username}?
ru_ru: Какое сообщение отправить пользователю, @{moderator_username}?

# Vote status displaying disabled
source: From now other chat users WILL NOT see current votes distribution.
ru_ru: Теперь другие участники чата модераторов не увидят распределение голосов в голосовании до его окончания.

# Vote status displaying enabled
source: From now other chat users WILL see current votes distribution.
ru_ru: Теперь другие участники чата модераторов будут видеть распределение голосов в голосовании.

# User`s vote successfully counted
source: Counted.
ru_ru: Ваш голос учтён.

# User tapped voting button second time
source: Your vote is already counted. You changed nothing this time.
ru_ru: Вы уже проголосовали.

# Beginning of poll message
source: Current poll progress:
ru_ru: Текущий прогресс голосования:

# Count of voted moderators
source: {cnt} vote
ru_ru: {cnt} голос

# Poll finished
source: Poll is closed.
ru_ru: Голосование завершено.

# Vote successful, message is published
source: The message is published.
ru_ru: Сообщение опубликовано.

# Vote successful
source: The message will be published soon.
ru_ru: Сообщение будет опубликовано в ближайшем будущем.

# Vote failed
source: The message will not be published.
ru_ru: Сообщение не будет опубликовано.

# Reply to user button
source: Reply
ru_ru: Ответить

# Ban user button
source: Ban this ass
ru_ru: Забанить негодяя

# Verification message
source: What will we do with this message?
ru_ru: Время голосовать!

# Boolean settings
source: on
ru_ru: вкл

# Boolean settings
source: off
ru_ru: выкл

# Newer poll for this message posted below
source: _Outdated_
ru_ru: _Устарело_

# User sent a gif for verification while gifs are disabled
source: Accepting gifs is disabled
ru_ru: Приём гифок отключён.

# Content type
source: Gif
ru_ru: Гифки
