Repository: andrey-yantsen/boterator
Catalog: locales/*/LC_MESSAGES/boterator.po
Languages: ru_ru

# Content type enabled/disabled
source: Gifs enabled
ru_ru: Гифки разрешены.

# Content type enabled/disabled
source: Gifs disabled
ru_ru: Гифки запрещены.

# Votes left to make a decision
source: {cnt} more to win
ru_ru: ещё {cnt} для победы

source: User already banned
ru_ru: Пользователь уже забанен.

# Somebody banned a user faster than another one
source: Somebody already banned the user. Be faster next time.
ru_ru: Кто-то успел забанить пользователя раньше вас. Будьте быстрее в следующий раз.

# Self-vote disabled
source: From now moderators WILL NOT be able to vote for own messages.
ru_ru: Теперь модераторы не могут голосовать за свои сообщения.

# Self-vote enabled
source: From now moderators WILL BE able to vote for own messages.
ru_ru: Теперь модераторы могут голосовать за свои сообщения.

# Moderator voted for own message
source: It's not allowed to vote for own messages
ru_ru: Нельзя голосовать за своё сообщение.

# Command name
source: /reg - register a new bot
ru_ru: /reg — регистрация нового бота

# Bot registration failed
source: Unable to register the bot, please contact @andrey_yantsen.
ru_ru: Не удалось зарегистрировать вашего бота, пожалуйста свяжитесь с @andrey_yantsen и всё обязательно будет исправлено.

# Voting failed
source: Unfortunately your message not received enough votes and won't be published to the channel.
ru_ru: К сожалению, ваше сообщение не получило достаточно голосов и не будет опубликовано в канале.

# Voting failed
source: Unfortunately your message not passed moderation and won't be published to the channel.
ru_ru: К сожалению, ваше сообщение не прошло модерацию и не будет опубликовано в канале.
